ХМНПФ_Общее/DataProcessors/уп_ФормированиеРешенийОДополнительнойЕдиновременнойВыплате.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ФормированиеРешенийОДополнительнойЕдиновременнойВыплате</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_СостояниеОсновнойЧастиПенсионногоСчетаОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СостояниеОсновнойЧастиПенсионногоСчетаОПС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_СостояниеЧастиПенсионногоСчетаОПС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаУстановкиСостояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Расшифровка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_РасшифровкаСостоянияДоговораОПС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_СостояниеЧастиПенсионногоСчетаОПС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаУстановкиСостояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Расшифровка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_РасшифровкаСостоянияДоговораОПС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/AccumulationRegisters/уп_РезервыОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_РезервыОПС</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаКомпенсации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаВосполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаВозмещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Движение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ВидыДвижений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументРегистрации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уп_ДокументРегистрации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидДвиженияЕПС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.епс_ВидыДвиженияПенсионныхНакоплений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипСуммы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ТипыСуммОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипРезерва</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыРезервовОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ХМНПФ_Общее/AccumulationRegisters/уп_ТекущаяСуммаГарантирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ТекущаяСуммаГарантирования</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипСуммы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ТипыСуммОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ХМНПФ_Общее/Enums/уп_СостояниеЧастиПенсионногоСчетаОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СостояниеЧастиПенсионногоСчетаОПС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НакопительныйПериод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НЧТП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СрочнаяВыплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиновременнаяВыплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Прекращен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОбязательстваВыполнены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПрекращениеНП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/Enums/уп_ТипыРезервовОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ТипыРезервовОПС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервПенсионныйНакоплений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервСрочнойВыплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Выплатной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервОПС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервЕВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийНП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийСВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийЕВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийРасторжение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийНаследованиеРПН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийНаследованиеРСВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийНаследованиеРОПС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийВозвратМСКРПН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийВозвратМСКРСВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНаследниковРПН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНаследниковРСВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийРазделениеСНИЛС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/DataProcessors/уп_ФормированиеРешенийОДополнительнойЕдиновременнойВыплате/Forms/уф_Форма/Ext/Form/Module.bsl
Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ 23.08.2021 ШадринАВ // СформироватьНаСервере() // №3295
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("СформироватьНаСервере")
Процедура ХМСформироватьНаСервере(мТабДок)
	ВедетсяРезервЕВ = ТекущееЗначениеКонстанты();
	Если ВедетсяРезервЕВ Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =

		"ВЫБРАТЬ
		|	уп_СостояниеОсновнойЧастиПенсионногоСчетаОПССрезПоследних.ДоговорОПС КАК ДоговорОПС
		|ПОМЕСТИТЬ ДоговорыДляЕдиновременнойВыплат
		|ИЗ
		|	РегистрСведений.уп_СостояниеОсновнойЧастиПенсионногоСчетаОПС.СрезПоследних(&Дата, ДоговорОПС.Организация = &Организация) КАК уп_СостояниеОсновнойЧастиПенсионногоСчетаОПССрезПоследних
		|ГДЕ
		|	уп_СостояниеОсновнойЧастиПенсионногоСчетаОПССрезПоследних.Состояние В(&СписокЗакрытых)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПССрезПоследних.ДоговорОПС КАК ДоговорОПС,
		|	уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПССрезПоследних.Состояние КАК Состояние
		|ПОМЕСТИТЬ ЕдиновременнаяВыплатаПоДопЧасти
		|ИЗ
		|	РегистрСведений.уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПС.СрезПоследних(&Дата, ДоговорОПС.Организация = &Организация) КАК уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПССрезПоследних
		|ГДЕ
		|	уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПССрезПоследних.Состояние В(&СписокЗакрытых)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_ДатыОбращенияЗаЕдиновременнойВыплатойСрезПоследних.ДоговорОПС КАК ДоговорОПС,
		|	МАКСИМУМ(уп_ДатыОбращенияЗаЕдиновременнойВыплатойСрезПоследних.ДатаОбращения) КАК ДатаОбращения
		|ПОМЕСТИТЬ ДатыЗаявлений
		|ИЗ
		|	РегистрСведений.уп_ДатыОбращенияЗаЕдиновременнойВыплатой.СрезПоследних(&Дата, ) КАК уп_ДатыОбращенияЗаЕдиновременнойВыплатойСрезПоследних
		|ГДЕ
		|	уп_ДатыОбращенияЗаЕдиновременнойВыплатойСрезПоследних.ДоговорОПС В
		|			(ВЫБРАТЬ
		|				ДоговорыДляЕдиновременнойВыплат.ДоговорОПС
		|			ИЗ
		|				ДоговорыДляЕдиновременнойВыплат)
		|	И уп_ДатыОбращенияЗаЕдиновременнойВыплатойСрезПоследних.ДатаОбращения МЕЖДУ &Дата1 И &Дата2
		|
		|СГРУППИРОВАТЬ ПО
		|	уп_ДатыОбращенияЗаЕдиновременнойВыплатойСрезПоследних.ДоговорОПС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_ДатыОбращенияЗаЕдиновременнойВыплатойСрезПоследних.ДоговорОПС КАК ДоговорОПС,
		|	уп_ДатыОбращенияЗаЕдиновременнойВыплатойСрезПоследних.ДатаОбращения КАК ДатаОбращения,
		|	уп_ДатыОбращенияЗаЕдиновременнойВыплатойСрезПоследних.ВключатьДопВзносы КАК ВключатьДопВзносы,
		|	ВЫБОР
		|		КОГДА уп_ДатыОбращенияЗаЕдиновременнойВыплатойСрезПоследних.Регистратор ССЫЛКА Документ.уп_РешениеОЕдиновременнойВыплате
		|			ТОГДА уп_ДатыОбращенияЗаЕдиновременнойВыплатойСрезПоследних.Регистратор.ДокументОснование
		|		ИНАЧЕ &ПустоеЗаявление
		|	КОНЕЦ КАК Заявление
		|ПОМЕСТИТЬ ДатыЗаявленийСУсловием
		|ИЗ
		|	РегистрСведений.уп_ДатыОбращенияЗаЕдиновременнойВыплатой.СрезПоследних(&Дата, ) КАК уп_ДатыОбращенияЗаЕдиновременнойВыплатойСрезПоследних
		|ГДЕ
		|	уп_ДатыОбращенияЗаЕдиновременнойВыплатойСрезПоследних.ДоговорОПС В
		|			(ВЫБРАТЬ
		|				ДоговорыДляЕдиновременнойВыплат.ДоговорОПС
		|			ИЗ
		|				ДоговорыДляЕдиновременнойВыплат)
		|	И уп_ДатыОбращенияЗаЕдиновременнойВыплатойСрезПоследних.ДатаОбращения МЕЖДУ &Дата1 И &Дата2
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДатыЗаявлений.ДоговорОПС КАК ДоговорОПС,
		|	ДатыЗаявлений.ДатаОбращения КАК ДатаОбращения,
		|	НЕ ДатыЗаявленийСУсловием.ВключатьДопВзносы КАК НеУчитыватьДопВзносы,
		|	ДатыЗаявленийСУсловием.Заявление КАК Заявление
		|ПОМЕСТИТЬ ДанныеПоследнихЗаявлений
		|ИЗ
		|	ДатыЗаявлений КАК ДатыЗаявлений
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДатыЗаявленийСУсловием КАК ДатыЗаявленийСУсловием
		|		ПО ДатыЗаявлений.ДоговорОПС = ДатыЗаявленийСУсловием.ДоговорОПС
		|			И ДатыЗаявлений.ДатаОбращения = ДатыЗаявленийСУсловием.ДатаОбращения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоговорыДляЕдиновременнойВыплат.ДоговорОПС КАК ДоговорОПС,
		|	ЕдиновременнаяВыплатаПоДопЧасти.Состояние КАК СостояниеДопЧасти,
		|	ДанныеПоследнихЗаявлений.ДатаОбращения КАК ДатаОбращения,
		|	ДанныеПоследнихЗаявлений.НеУчитыватьДопВзносы КАК НеУчитыватьДопВзносы,
		|	ДанныеПоследнихЗаявлений.Заявление КАК Заявление
		|ПОМЕСТИТЬ ТаблицаСЗаявлениями
		|ИЗ
		|	ДоговорыДляЕдиновременнойВыплат КАК ДоговорыДляЕдиновременнойВыплат
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЕдиновременнаяВыплатаПоДопЧасти КАК ЕдиновременнаяВыплатаПоДопЧасти
		|		ПО ДоговорыДляЕдиновременнойВыплат.ДоговорОПС = ЕдиновременнаяВыплатаПоДопЧасти.ДоговорОПС
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПоследнихЗаявлений КАК ДанныеПоследнихЗаявлений
		|		ПО ДоговорыДляЕдиновременнойВыплат.ДоговорОПС = ДанныеПоследнихЗаявлений.ДоговорОПС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаСЗаявлениями.ДоговорОПС КАК ДоговорОПС,
		|	ТаблицаСЗаявлениями.СостояниеДопЧасти КАК СостояниеДопЧасти,
		|	ТаблицаСЗаявлениями.НеУчитыватьДопВзносы КАК НеУчитыватьДопВзносы,
		|	ТаблицаСЗаявлениями.Заявление КАК ДокументОснование,
		|	ТаблицаСЗаявлениями.ДатаОбращения КАК ДатаОбращения
		|ПОМЕСТИТЬ ТабДоговоровПодДопЕВ
		|ИЗ
		|	ТаблицаСЗаявлениями КАК ТаблицаСЗаявлениями
		|ГДЕ
		|	ТаблицаСЗаявлениями.ДатаОбращения МЕЖДУ &Дата1 И &Дата2
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_РезервыОПСОстатки.ДоговорОПС КАК ДоговорОПС,
		|	уп_РезервыОПСОстатки.ТипСуммы КАК ТипСуммы,
		|	уп_РезервыОПСОстатки.ТипРезерва КАК ТипРезерва,
		|	уп_РезервыОПСОстатки.СуммаОстаток КАК Сумма,
		|	уп_РезервыОПСОстатки.СуммаКомпенсацииОстаток КАК СуммаКомпенсации,
		|	уп_РезервыОПСОстатки.СуммаВосполненияОстаток КАК СуммаВосполнения,
		|	уп_РезервыОПСОстатки.СуммаВозмещенияОстаток КАК СуммаВозмещения
		|ПОМЕСТИТЬ ОстаткиВРезервеЕВ
		|ИЗ
		|	РегистрНакопления.уп_РезервыОПС.Остатки(
		|			&Дата,
		|			ДоговорОПС В
		|					(ВЫБРАТЬ
		|						ТабДоговоровПодДопЕВ.ДоговорОПС
		|					ИЗ
		|						ТабДоговоровПодДопЕВ)
		|				И ТипРезерва = &РезервЕВ) КАК уп_РезервыОПСОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_ТекущаяСуммаГарантированияОстатки.ДоговорОПС КАК ДоговорОПС,
		|	уп_ТекущаяСуммаГарантированияОстатки.ТипСуммы КАК ТипСуммы,
		|	уп_ТекущаяСуммаГарантированияОстатки.СуммаОстаток КАК СуммаГарантирования
		|ПОМЕСТИТЬ ТекСуммаГарантирования
		|ИЗ
		|	РегистрНакопления.уп_ТекущаяСуммаГарантирования.Остатки(
		|			&Дата,
		|			ДоговорОПС В
		|				(ВЫБРАТЬ
		|					ТабДоговоровПодДопЕВ.ДоговорОПС
		|				ИЗ
		|					ТабДоговоровПодДопЕВ)) КАК уп_ТекущаяСуммаГарантированияОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстаткиВРезервеЕВ.ТипСуммы КАК ТипСуммы,
		|	ОстаткиВРезервеЕВ.Сумма КАК Сумма,
		|	ОстаткиВРезервеЕВ.СуммаКомпенсации КАК СуммаКомпенсации,
		|	ОстаткиВРезервеЕВ.СуммаВосполнения КАК СуммаВосполнения,
		|	ОстаткиВРезервеЕВ.СуммаВозмещения КАК СуммаВозмещения,
		|	ЕСТЬNULL(ТекСуммаГарантирования.СуммаГарантирования, 0) КАК СуммаГарантирования,
		|	ОстаткиВРезервеЕВ.ДоговорОПС КАК ДоговорОПС,
		|	ОстаткиВРезервеЕВ.ТипРезерва КАК ТипРезерва
		|ПОМЕСТИТЬ РаскладкаПоСуммам
		|ИЗ
		|	ОстаткиВРезервеЕВ КАК ОстаткиВРезервеЕВ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТекСуммаГарантирования КАК ТекСуммаГарантирования
		|		ПО ОстаткиВРезервеЕВ.ДоговорОПС = ТекСуммаГарантирования.ДоговорОПС
		|			И ОстаткиВРезервеЕВ.ТипСуммы = ТекСуммаГарантирования.ТипСуммы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабДоговоровПодДопЕВ.ДоговорОПС КАК ДоговорОПС,
		|	ТабДоговоровПодДопЕВ.СостояниеДопЧасти КАК СостояниеДопЧасти,
		|	ТабДоговоровПодДопЕВ.НеУчитыватьДопВзносы КАК НеУчитыватьДопВзносы,
		|	ТабДоговоровПодДопЕВ.ДокументОснование КАК ДокументОснование,
		|	ТабДоговоровПодДопЕВ.ДатаОбращения КАК ДатаОбращения,
		|	РаскладкаПоСуммам.ТипСуммы КАК ТипСуммы,
		|	ЕстьNULL(РаскладкаПоСуммам.Сумма,0) КАК СуммаОстаток,
		|	ЕстьNULL(РаскладкаПоСуммам.СуммаКомпенсации,0) КАК СуммаКомпенсации,
		|	ЕстьNULL(РаскладкаПоСуммам.СуммаВосполнения,0) КАК СуммаВосполнения,
		|	ЕстьNULL(РаскладкаПоСуммам.СуммаВозмещения,0) КАК СуммаВозмещения,
		|	ЕстьNULL(РаскладкаПоСуммам.СуммаГарантирования,0) КАК СуммаГарантирования,
		|	РаскладкаПоСуммам.ТипРезерва КАК ТипРезерва
		|ИЗ
		|	ТабДоговоровПодДопЕВ КАК ТабДоговоровПодДопЕВ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РаскладкаПоСуммам КАК РаскладкаПоСуммам
		|		ПО ТабДоговоровПодДопЕВ.ДоговорОПС = РаскладкаПоСуммам.ДоговорОПС
		|ИТОГИ
		|	СУММА(СуммаОстаток),
		|	СУММА(СуммаКомпенсации),
		|	СУММА(СуммаВосполнения),
		|	СУММА(СуммаВозмещения),
		|	СУММА(СуммаГарантирования)
		|ПО
		|	ДоговорОПС";

		Запрос.УстановитьПараметр("Организация",Объект.Организация);
		Запрос.УстановитьПараметр("Дата",Объект.ДатаФормированияДокументов);
		СписокЗакрытых = Новый СписокЗначений;
		СписокЗакрытых.Добавить(Перечисления.уп_СостояниеЧастиПенсионногоСчетаОПС.ЕдиновременнаяВыплата);
		Запрос.УстановитьПараметр("СписокЗакрытых",СписокЗакрытых);
		Запрос.УстановитьПараметр("ПустоеЗаявление",Документы.уп_ЗаявлениеЗЛОЕдиновременнойВыплате.ПустаяСсылка());
		Запрос.УстановитьПараметр("Дата1",Объект.ДатаНачала);
		Запрос.УстановитьПараметр("Дата2",КонецДня(Объект.ДатаКонца));
		Запрос.УстановитьПараметр("РезервЕВ",Перечисления.уп_ТипыРезервовОПС.РезервЕВ);

		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

		Элементы.Сформировать.Доступность = Ложь;
		Элементы.Отменить.Доступность = Истина;
		Элементы.Провести.Доступность = Истина;
		Элементы.Применить.Доступность = Истина;
		ЕстьНеутвержденныеДокументы = Истина;
		Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.ОсновнаяПанель.ПодчиненныеЭлементы.Получить(0);

		СформироватьРешенияРезервЕВ(Выборка);
	Иначе	
		Запрос = Новый Запрос;
		Запрос.Текст =

		"ВЫБРАТЬ
		|	уп_СостояниеОсновнойЧастиПенсионногоСчетаОПССрезПоследних.ДоговорОПС
		|ПОМЕСТИТЬ ДоговорыДляЕдиновременнойВыплат
		|ИЗ
		|	РегистрСведений.уп_СостояниеОсновнойЧастиПенсионногоСчетаОПС.СрезПоследних(&Дата, ДоговорОПС.Организация = &Организация) КАК уп_СостояниеОсновнойЧастиПенсионногоСчетаОПССрезПоследних
		|ГДЕ
		|	уп_СостояниеОсновнойЧастиПенсионногоСчетаОПССрезПоследних.Состояние В(&СписокЗакрытых)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПССрезПоследних.ДоговорОПС,
		|	уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПССрезПоследних.Состояние
		|ПОМЕСТИТЬ ЕдиновременнаяВыплатаПоДопЧасти
		|ИЗ
		|	РегистрСведений.уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПС.СрезПоследних(&Дата, ДоговорОПС.Организация = &Организация) КАК уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПССрезПоследних
		|ГДЕ
		|	уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПССрезПоследних.Состояние В(&СписокЗакрытых)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_ДатыОбращенияЗаЕдиновременнойВыплатойСрезПоследних.ДоговорОПС,
		|	МАКСИМУМ(уп_ДатыОбращенияЗаЕдиновременнойВыплатойСрезПоследних.ДатаОбращения) КАК ДатаОбращения
		|ПОМЕСТИТЬ ДатыЗаявлений
		|ИЗ
		|	РегистрСведений.уп_ДатыОбращенияЗаЕдиновременнойВыплатой.СрезПоследних(&Дата, ) КАК уп_ДатыОбращенияЗаЕдиновременнойВыплатойСрезПоследних
		|ГДЕ
		|	уп_ДатыОбращенияЗаЕдиновременнойВыплатойСрезПоследних.ДоговорОПС В
		|			(ВЫБРАТЬ
		|				ДоговорыДляЕдиновременнойВыплат.ДоговорОПС
		|			ИЗ
		|				ДоговорыДляЕдиновременнойВыплат)
		|	И уп_ДатыОбращенияЗаЕдиновременнойВыплатойСрезПоследних.ДатаОбращения МЕЖДУ &Дата1 И &Дата2
		|
		|СГРУППИРОВАТЬ ПО
		|	уп_ДатыОбращенияЗаЕдиновременнойВыплатойСрезПоследних.ДоговорОПС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_ДатыОбращенияЗаЕдиновременнойВыплатойСрезПоследних.ДоговорОПС,
		|	уп_ДатыОбращенияЗаЕдиновременнойВыплатойСрезПоследних.ДатаОбращения КАК ДатаОбращения,
		|	уп_ДатыОбращенияЗаЕдиновременнойВыплатойСрезПоследних.ВключатьДопВзносы,
		|	ВЫБОР
		|		КОГДА уп_ДатыОбращенияЗаЕдиновременнойВыплатойСрезПоследних.Регистратор ССЫЛКА Документ.уп_РешениеОЕдиновременнойВыплате
		|			ТОГДА уп_ДатыОбращенияЗаЕдиновременнойВыплатойСрезПоследних.Регистратор.ДокументОснование
		|		ИНАЧЕ &ПустоеЗаявление
		|	КОНЕЦ КАК Заявление
		|ПОМЕСТИТЬ ДатыЗаявленийСУсловием
		|ИЗ
		|	РегистрСведений.уп_ДатыОбращенияЗаЕдиновременнойВыплатой.СрезПоследних(&Дата, ) КАК уп_ДатыОбращенияЗаЕдиновременнойВыплатойСрезПоследних
		|ГДЕ
		|	уп_ДатыОбращенияЗаЕдиновременнойВыплатойСрезПоследних.ДоговорОПС В
		|			(ВЫБРАТЬ
		|				ДоговорыДляЕдиновременнойВыплат.ДоговорОПС
		|			ИЗ
		|				ДоговорыДляЕдиновременнойВыплат)
		|	И уп_ДатыОбращенияЗаЕдиновременнойВыплатойСрезПоследних.ДатаОбращения МЕЖДУ &Дата1 И &Дата2
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДатыЗаявлений.ДоговорОПС,
		|	ДатыЗаявлений.ДатаОбращения,
		|	НЕ ДатыЗаявленийСУсловием.ВключатьДопВзносы КАК НеУчитыватьДопВзносы,
		|	ДатыЗаявленийСУсловием.Заявление
		|ПОМЕСТИТЬ ДанныеПоследнихЗаявлений
		|ИЗ
		|	ДатыЗаявлений КАК ДатыЗаявлений
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДатыЗаявленийСУсловием КАК ДатыЗаявленийСУсловием
		|		ПО ДатыЗаявлений.ДоговорОПС = ДатыЗаявленийСУсловием.ДоговорОПС
		|			И ДатыЗаявлений.ДатаОбращения = ДатыЗаявленийСУсловием.ДатаОбращения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоговорыДляЕдиновременнойВыплат.ДоговорОПС КАК ДоговорОПС,
		|	ЕдиновременнаяВыплатаПоДопЧасти.Состояние КАК СостояниеДопЧасти,
		|	ДанныеПоследнихЗаявлений.ДатаОбращения,
		|	ДанныеПоследнихЗаявлений.НеУчитыватьДопВзносы КАК НеУчитыватьДопВзносы,
		|	ДанныеПоследнихЗаявлений.Заявление
		|ПОМЕСТИТЬ ТаблицаСЗаявлениями
		|ИЗ
		|	ДоговорыДляЕдиновременнойВыплат КАК ДоговорыДляЕдиновременнойВыплат
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЕдиновременнаяВыплатаПоДопЧасти КАК ЕдиновременнаяВыплатаПоДопЧасти
		|		ПО ДоговорыДляЕдиновременнойВыплат.ДоговорОПС = ЕдиновременнаяВыплатаПоДопЧасти.ДоговорОПС
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПоследнихЗаявлений КАК ДанныеПоследнихЗаявлений
		|		ПО ДоговорыДляЕдиновременнойВыплат.ДоговорОПС = ДанныеПоследнихЗаявлений.ДоговорОПС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаСЗаявлениями.ДоговорОПС,
		|	ТаблицаСЗаявлениями.СостояниеДопЧасти,
		|	ТаблицаСЗаявлениями.НеУчитыватьДопВзносы,
		|	ТаблицаСЗаявлениями.Заявление КАК ДокументОснование,
		|	ТаблицаСЗаявлениями.ДатаОбращения
		|ИЗ
		|	ТаблицаСЗаявлениями КАК ТаблицаСЗаявлениями
		|ГДЕ
		|	ТаблицаСЗаявлениями.ДатаОбращения МЕЖДУ &Дата1 И &Дата2";

		Запрос.УстановитьПараметр("Организация",Объект.Организация);
		Запрос.УстановитьПараметр("Дата",Объект.ДатаФормированияДокументов);
		СписокЗакрытых = Новый СписокЗначений;
		СписокЗакрытых.Добавить(Перечисления.уп_СостояниеЧастиПенсионногоСчетаОПС.ЕдиновременнаяВыплата);
		Запрос.УстановитьПараметр("СписокЗакрытых",СписокЗакрытых);
		Запрос.УстановитьПараметр("ПустоеЗаявление",Документы.уп_ЗаявлениеЗЛОЕдиновременнойВыплате.ПустаяСсылка());
		Запрос.УстановитьПараметр("Дата1",Объект.ДатаНачала);
		Запрос.УстановитьПараметр("Дата2",КонецДня(Объект.ДатаКонца));

		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();

		ТабДляПротокола = Результат.Выгрузить();
		Если Объект.ТолькоПротокол Тогда
			мТабДок=СформироватьПротокол(ТабДляПротокола);
		Иначе
			мТабДок=СформироватьПротокол(ТабДляПротокола);

			Элементы.Сформировать.Доступность = Ложь;
			Элементы.Отменить.Доступность = Истина;
			Элементы.Провести.Доступность = Истина;
			Элементы.Применить.Доступность = Истина;
			ЕстьНеутвержденныеДокументы = Истина;
			Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.ОсновнаяПанель.ПодчиненныеЭлементы.Получить(0);

			СформироватьРешения(Выборка);
		КонецЕсли;

		#Удаление
		мТабДок = Новый ТабличныйДокумент;
		мОбъект=РеквизитФормыВЗначение("Объект");
		Макет = мОбъект.ПолучитьМакет("Макет");
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
		мТабДок.Вывести(ОбластьШапка);
		#КонецУдаления
		#Вставка 
		// +ХМНПФ 23.08.2021 ШадринАВ // СформироватьНаСервере() // №3295
		#КонецВставки
	КонецЕсли;
	//Если мТабДок<>Неопределено Тогда
	//	мТабДок.Показать();
	//КонецЕсли;

КонецПроцедуры
